### Bayes' Theorem

##### Question:

Calculate the probability of number of female survived from titanic.csv dataset

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

#### Print 2 columns i.e. Sex and Survived from the dataset

In [4]:
df = df[['Sex','Survived']]
df.head()
#Here O = not survived and 1 = survived

      Sex  Survived
0    male         0
1  female         1
2  female         1
3  female         1
4    male         0

#### Calculate number of people survived

In [5]:
df['Survived']==1

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Name: Survived, Length: 891, dtype: bool

In [6]:
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [7]:
survival_num = df[df['Survived']==1]['Survived'].count()
print("Number of people survived=",survival_num)

Number of people survived= 342

#### Calculate number of people not survived

In [8]:
nsurvival_num = df[df['Survived']==0]['Survived'].count()
print("Number of people unsurvived=",nsurvival_num)

Number of people unsurvived= 549

#### Calculate the probability of number of female survived

In [9]:
len(df[(df['Survived']==1)&(df['Sex']=='female')])/len(df[df["Sex"]=='female'])

0.7420382165605095